Revit 2027 API
ParameterTypeId.StructConnectionColumnBase Property
 "Base Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructConnectionColumnBase { get; }
Public Shared ReadOnly Property StructConnectionColumnBase As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructConnectionColumnBase {
	ForgeTypeId^ get ();
}
static member StructConnectionColumnBase : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace